package io.github.weechang.config;

/**
 * 密码配置文件
 */
public class Password {

    /**
     * 常用密码
     */
    public static final String[] MOST_USE = {
            "11111111", "00000000", "11223344", "0123456789", "147258369", "66666666", "123123123", "8888888888", "12341234",
            "88889999", "11112222", "a1b2c3d4", "22222222", "999999999", "99999999", "1111111111", "77777777", "23456789",
            "1122334455", "55555555", "qwertyuiop", "888888888", "111111111", "12345687", "012345678", "abcd1234",
            "al23456789", "0000000000", "q1w2e3r4", "55555555", "987654321", "9876543210", "0987654321", "87654321", "1234567890"
    };

    /**
     * 常用密码组合
     */
    public static final String[] MOST_COUPLE = {
            "1234", "12345", "123456", "1234567", "12345678", "12345890", "54321", "654321", "754321", "8754321",
            "9754321", "12344321", "121314", "88888888", "888888", "666666", "666", "2016", "2015", "abc", "admin",
            "asd", "xyz", "super", "0101", "010203", "love", "6868", "110", "fuck", "1314", "568", "up", "china",
            "!@#"
    };

    /**
     * 常用年份
     */
    public static final String[] YEAR = {
            "1985", "1986", "1987", "1988", "1989", "1990", "1991", "1992", "1993", "1994",
            "1995", "1996", "1997", "1998", "1999", "2000", "2001", "2002", "2003", "2004",
            "2005", "2006", "2007", "2008", "2009", "2010", "2011", "2012", "2013", "2014",
            "2015", "2016", "2017", "2018"
    };

    /**
     * 常用月份
     */

    public static final String[] MONTH = {
            "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12"
    };

    /**
     * 常用日期
     */
    public static final String[] DAY = {
            "01", "02", "03", "04", "05", "06", "07", "08", "09", "10",
            "11", "12", "13", "14", "15", "16", "17", "18", "19", "20",
            "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31"
    };

    /**
     * 常用姓氏
     */
    public static final String[] SURN = {
            "li", "wang", "zhang", "liu", "chen", "yang", "zhao", "huang", "zhou", "wu",
            "xu", "sun", "hu", "zhu", "gao", "lin", "he", "guo", "ma", "luo",
            "lian", "song", "zheng", "xie", "han", "tang", "feng", "yu", "dong", "xiao"
    };

    /**
     * 能做汉字首字母的
     */
    public static final String[] HAN = {
            "a", "b", "c", "d", "e", "f", "g", "h", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "w", "x", "y", "z"
    };

    /**
     * 声母
     */
    public static final String[] HAN_1 = {
            "b", "p", "m", "f", "d", "t", "n", "l", "g", "k", "h", "j", "q", "x", "z", "c", "s", "r", "zh", "ch", "sh", "y", "w"
    };

    /**
     * 韵母
     */
    public static final String[] HAN_2 = {
            "a", "o", "e", "i", "u", "v", "ai", "ei", "ui", "ao", "ou", "iu", "ie", "ue", "er", "an", "en", "in", "un", "vn", "ang", "eng", "ing", "ong"
    };

    /**
     * 整体认读音节
     */
    public static final String[] HAN_0 = {
            "zhi", "chi", "shi", "ri", "zi", "ci", "si", "yi", "wu", "yu", "ye", "yue", "yuan", "yin", "yun", "ying"
    };


    /**
     * 常用特殊符号
     */
    public static final String[] MOST_SIN = {
            "!", "@", "#", "$", "*", "-", "_"
    };
}
